package sketchbook.imageprocessing
{
	/** DotPtternクラスで使用しそうなパターンの詰め合わせ */
	public class DotPatterns
	{
		public static const DOT_1_1 : Array = [[0,1],[1,0]]
		
		public static const DOT_1_2 : Array = [[1,0],[0,0]]
		public static const DOT_1_3 : Array = [[1,0,0],[0,0,0],[0,0,0]]
		public static const DOT_1_4 : Array = [[1,0,0,0],[0,0,0,0],[0,0,0,0],[0,0,0,0]]
		
		public static const DOT_2_2 : Array = [[1,1,0,0],[1,1,0,0],[0,0,1,1],[0,0,1,1]]

		public static const LINE_H_1_1 : Array = [[1],[0]]
		public static const LINE_H_1_2 : Array = [[1],[0],[0]]
		public static const LINE_H_1_3 : Array = [[1],[0],[0],[0]]
		public static const LINE_H_1_4 : Array = [[1],[0],[0],[0],[0]]
		
		public static const LINE_V_1_1 : Array = [[1,0]]
		public static const LINE_V_1_2 : Array = [[1,0,0]]
		public static const LINE_V_1_3 : Array = [[1,0,0,0]]
		public static const LINE_V_1_4 : Array = [[1,0,0,0,0]]
		
		public static const SLASH_R_1_2 : Array = [[0,0,1],[0,1,0],[1,0,0]]
		public static const SLASH_L_1_2 : Array = [[1,0,0],[0,1,0],[0,0,1]]
		public static const SLASH_R_1_3 : Array = [[0,0,0,1],[0,0,1,0],[0,1,0,0],[1,0,0,0]]
		public static const SLASH_L_1_3 : Array = [[1,0,0,0],[0,1,0,0],[0,0,1,0],[0,0,0,1]]
		public static const SLASH_R_1_4 : Array = [[0,0,0,0,1],[0,0,0,1,0],[0,0,1,0,0],[0,1,0,0,0],[1,0,0,0,0]]
		public static const SLASH_L_1_4 : Array = [[1,0,0,0,0],[0,1,0,0,0],[0,0,1,0,0],[0,0,0,1,0],[0,0,0,0,1]]
		
		public static const CROSS_4 : Array = [[1,0,1,0],[0,1,0,0],[1,0,1,0],[0,0,0,1]]
		public static const CROSS_5 : Array = [[1,0,0,0,1],[0,1,0,1,0],[0,0,1,0,0],[0,1,0,1,0],[1,0,0,0,1]]
		
		public static const SPECIAL_0 : Array = [[1,0,0,1,1,0,0,1],[0,0,1,0,0,1,0,0],[0,1,0,0,0,0,1,0],[1,0,0,1,1,0,0,1],[1,0,0,1,1,0,0,1],[0,1,0,0,0,0,1,0],[0,0,1,0,0,1,0,0],[1,0,0,1,1,0,0,1]]
		public static const SPECIAL_1 : Array = [[0,1,1,0,1,0,0,1],[1,0,0,1,0,1,1,0],[1,0,0,1,0,1,1,0],[0,1,1,0,1,0,0,1],[1,0,0,1,0,1,1,0],[0,1,1,0,1,0,0,1],[0,1,1,0,1,0,0,1],[1,0,0,1,0,1,1,0]]
		public static const SPECIAL_2 : Array = [[1,0,0,1,0,0,0,0],[0,1,0,0,0,0,1,0],[0,0,1,0,0,1,0,0],[1,0,0,1,0,0,0,0],[0,0,0,0,1,0,0,1],[0,0,1,0,0,1,0,0],[0,1,0,0,0,0,1,0],[0,0,0,0,1,0,0,1]]
		public static const SPECIAL_3 : Array = [[0,1,0,0,0,0,1,0,1,0,1,1,1,1,0,1],
													[1,0,1,1,1,1,0,1,0,1,0,0,0,0,1,0],
													[0,1,0,0,0,0,1,0,1,0,1,1,1,1,0,1],
													[0,1,0,0,0,0,1,0,1,0,1,1,1,1,0,1],
													[0,1,0,0,0,0,1,0,1,0,1,1,1,1,0,1],
													[0,1,0,0,0,0,1,0,1,0,1,1,1,1,0,1],
													[1,0,1,1,1,1,0,1,0,1,0,0,0,0,1,0],
													[0,1,0,0,0,0,1,0,1,0,1,1,1,1,0,1],
													[1,0,1,1,1,1,0,1,0,1,0,0,0,0,1,0],
													[0,1,0,0,0,0,1,0,1,0,1,1,1,1,0,1],
													[1,0,1,1,1,1,0,1,0,1,0,0,0,0,1,0],
													[1,0,1,1,1,1,0,1,0,1,0,0,0,0,1,0],
													[1,0,1,1,1,1,0,1,0,1,0,0,0,0,1,0],
													[1,0,1,1,1,1,0,1,0,1,0,0,0,0,1,0],
													[0,1,0,0,0,0,1,0,1,0,1,1,1,1,0,1],
													[1,0,1,1,1,1,0,1,0,1,0,0,0,0,1,0]
													]
	}
}